# создаем игру "Виселица"

import random as r


def simbol(s, w):
    buf = True

    for i in w:
        if s == i:
            buf = True
            break
        else: 
            buf = False

    return buf


def print_answer(s, w, str):
    l = list(str)

    for i in range(len(w)):
        if w[i] == s:
            l[i] = s

    return "".join(l)


def index(str):
    k = 0
    for i in str:
        if i != '_':
            k += 1

    return k


print('*'*60, '\n\nЗдравствуйте.\n'
      'Вас приветствует игра "Виселица".\n'
      '\nПравила игры:\n'
      '\n Для вас будет загадано слово, ваша задача его угадать.\n'
      ' Вы вводите по ОДНОЙ МАЛЕНЬКОЙ букве! Только РУССКИЕ!\n'
      ' Иначе, неверный ввод будет считаться за ошибку.\n'
      ' У вас 10 ошибок.\n'
      '\nБудьте внимательны!\n'
      'Удачи!\n\n', '*'*60, "\n", sep="")

gallows = {1: """
                |       
                |           
                |      
                |      
                |
                """,
           2: """
                |      
                |-          
                |     
                |     
                |
               ==========
                """,

           3: """
               --------|-
                |      
                |          
                |     
                |     
                |
               ==========
                """,
           4: """
               --------|-
                |      |
                |         
                |    
                |     
                |
               ==========
                """,
           5: """
               --------|-
                |      |
                |      O    
                |      
                |     
                |
               ==========
                """,
           6: """
               --------|-
                |      |
                |      O    
                |      |
                |      
                |
               ==========
                """,
           7: """
               --------|-
                |      |
                |      O    
                |     /|
                |      
                |
               ==========
                """,
           8: """
               --------|-
                |      |
                |      O    
                |     /|\\
                |      
                |
               ==========
                """,
           9: """
               --------|-
                |      |
                |      O    
                |     /|\\
                |     / 
                |
               ==========
                """,
           10: """
               --------|-
                |      |
                |      O    
                |     /|\\
                |     / \\
                |
               ==========
                """}

words = ['нейтрон', 'протон', 'электрон', 'физика', 'ядро', 'линза', 'волна', 'свет', 'материя', 'луч']
word = r.choice(words)

str = len(word) * "_"
print(str, " : ", len(word), " букв")

mistakes = 10
t = 0
f = 0

while True:
    s = input("Введите русскую букву: ")

    if simbol(s, word):
        str = print_answer(s, word, str)
        print("\n", str, "\n")
        t = index(str)
        if t == len(word):
            print("\n", "*"*21, "\n", "*  Вы победили !!!  *", "\n", "*"*21, sep="" )

            break
    else:
        f += 1
        print(gallows[f], "\nОсталось ошибок:",  mistakes - f)
        if f == 10:
            print("\n", "*"*22, "\n", "*  Вы проиграли !!!  *", "\n", "*"*22, sep="")
            break
